<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px"> 

## Lab: SQL Practice

_Author: Matt Brems_

### Required Preparation

In order to run SQL queries within Python/this Jupyter notebook, you will need to install the following:

```bash
conda install sqlalchemy
conda install psycopg2
```

If you get an error trying to install `psycopg2`, you can install a stand-alone package (sufficient for everything you'll need to complete this lab) by entering the following anywhere in the terminal: 

```bash 
pip install psycopg2-binary
```

(If `pip` doesn't work for you, try `pip3 install psycopg2-binary`.)

### Instructions

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the Iowa liquor database. It contains various tables of transactions. The schema for this database is here:

<img src="./images/schema.png" alt="schema" width="750"/>

In [1]:
# Install sqlalchemy & psycopg2 - You only need to do this once!

# conda install sqlalchemy
# conda install psycopg2

In [2]:
# Import Pandas and Create_Engine

import pandas as pd
from sqlalchemy import create_engine

# Set up the engine to access the data.
engine = create_engine('postgresql://analytics_student:analyticsga@analyticsga-psql.generalassemb.ly:5432/iowa_liquor_sales_database')

### Prompt 1

Can you display the count of rows in the `stores` table of the Iowa liquor database?

In [3]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT COUNT(*) FROM stores 
"""

pd.read_sql_query(sql, engine)

   count
0   1973

**Prompt 1 Answer**: 1973.

### Prompt 2

If you sort the stores in alphabetical order by name, which store is fourth?

In [4]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT * FROM stores ORDER BY name ASC LIMIT 1 OFFSET 3
"""

pd.read_sql_query(sql, engine)

,store,name,store_status,store_address,address_info
0,3061,3061 Cub Foods / Sioux City,I,"1732 Hamilton Blvd\nSioux City, IA 511030000\n...",None

**Prompt 2 Answer**: The store "3061 Cub Foods /Sioux City".

### Prompt 3

Among those sales whose category name is `IMPORTED VODKA`, if you sort by vendor in alphabetical order, what is the bottle price and number of bottles bought in the first 3 transactions?
> You should give us three sets of numbers - one for each transaction.

In [5]:
sql = """
SELECT btl_price,bottle_qty FROM sales WHERE category_name='IMPORTED VODKA' ORDER BY vendor ASC LIMIT 3

"""
pd.read_sql_query(sql, engine)

  btl_price  bottle_qty
0     $8.99          12
1    $28.50           1
2    $28.50           6

**Prompt 3 Answer**: {'transaction_1':{'bottle price':8.99,'number of bottles':12},'transaction_2':{'bottle price':28.50,'number of bottles':3},'transaction_3':{'bottle price':28.50,'number of bottles':3}}

### Prompt 4

What is the total revenue of liquor sold in February 2015?

In [6]:
# Use a SQL query to find the answer to the above prompt.

sql = """

SELECT SUM(btl_price*bottle_qty) FROM sales WHERE Extract(year from date)=2015
"""
pd.read_sql_query(sql, engine)

              sum
0  $39,853,626.66

**Prompt 4 Answer**: $39,853,626.66

### Prompt 5

Among all transactions where `IMPORTED VODKA` was sold, which vendor has the most transactions? Report the total number of transactions, the number of bottles sold, and the total amount of revenue from these transactions. Rename the columns to make sure there isn't any confusion as to what they mean!

In [7]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT vendor,count(*) AS no_transactions,SUM(bottle_qty) AS bottles_sold,SUM(bottle_qty*btl_price) AS revenue from sales where category_name='IMPORTED VODKA' group by vendor ORDER BY no_transactions DESC LIMIT 1
"""

pd.read_sql_query(sql, engine)

,vendor,no_transactions,bottles_sold,revenue
0,Pernod Ricard USA/Austin Nichols,42338,403450,"$7,880,365.88"

**Prompt 5 Answer**: Pernod Ricard USA/Austin Nichols has the most transactions of 42338 transactions, and there are 403450 bottles sold, with a total revenue of $7,880,365.88.

### Prompt 6

The reason we sell things is to make money. In sales, the term **markup** means the amount of extra money charged for a product over the cost to make that product. (You can think of the markup as the profit for that product.)

In Iowa, the law states the minimum price at which liquor may be sold.

Calculate the markup (name this `Markup`) that shows the difference between the `btl_price` and the `state_btl_cost`. 

> If you haven't subtracted columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [8]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT btl_price-state_btl_cost AS Markup FROM sales LIMIT 1
"""

pd.read_sql_query(sql, engine)

  markup
0  $5.75

### Prompt 7

Calculate the "Percentage Markup" by dividing markup by the state bottle cost. (Rather than the total profit per bottle, this will tell you how much stores are increasing their price over the state minimum.)

After calculating the "Percentage Markup," calculate the average percentage markup per **store**. Which store has the largest average markup, and what is that average markup?

In [9]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT store,AVG((btl_price-state_btl_cost)/state_btl_cost) AS Average_Percentage_Markup from sales GROUP BY store ORDER BY average_percentage_markup DESC LIMIT 1
"""
pd.read_sql_query(sql, engine)

   store  average_percentage_markup
0   4013                   0.525471

**Prompt 7 Answer**: The store with ID 4013 has the highest average markup at 52.55%.

### Prompt 8

Building off of your last query, retrieve the five stores with the highest average markup percentage. Along with the store IDs and average markup percentage, as well as the names and addresses of those store.

What are the names of the five stores?

In [10]:
sql="""
SELECT a.store,a.average_markup,b.name,b.store_address
FROM 
(SELECT store,AVG((btl_price-state_btl_cost)/state_btl_cost) AS Average_Markup from sales GROUP BY store) AS a
INNER JOIN stores b
ON a.store=b.store
ORDER BY a.average_markup DESC
LIMIT 5

"""
pd.read_sql_query(sql,engine)

,store,average_markup,name,store_address
0,4013,0.525471,Wal-Mart 0841 / Tipton,"1126 Highway 38 North\nTipton, IA 527720000\n(..."
1,4024,0.521499,Wal-Mart 1546 / Iowa Falls,"840 S Oak\nIowa Falls, IA 501260000\n(42.50295..."
2,4266,0.518903,Wal-Mart 1683 / Shenandoah,"705 S Fremont\nShenandoah, IA 516010000\n(40.7..."
3,3833,0.515094,Wal-Mart 3394 / Atlantic,"1905 East 7th St\nAtlantic, IA 500220000\n(41...."
4,3660,0.514591,Wal-Mart 2935 / Knoxville,"814 W Bell Ave\nKnoxville, IA 501380000\n(41.3..."

**Prompt 8 Answer**: The names of the five stores are 'Wal-Mart 0841 / Tipton','Wal-Mart 1546 / Iowa Falls','Wal-Mart 1683 / Shenandoah','Wal-Mart 3394 / Atlantic' and 'Wal-Mart 2935 / Knoxville'.

### Prompt 9

Which nine counties sell the highest number of bottles of liquor per capita (per person)? Calculate the average bottle size of the bottles of liquor sold by these counties rounded to the nearest first decimal place. Of the nine counties selling the highest number of bottles of liquor per capita, which county sells (on average) the largest bottle size?

**_BONUS FUN_**: This question can (also) be solved with a SQL subquery - that is, a query that queries a query! If you'd like to give this a try, you can read more about it [here](https://www.dofactory.com/sql/subquery). Otherwise, keep an eye out for the solution key!

In [11]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT a.county,a.sum,ROUND(a.bottle_size,1) as bottle_size,b.population,a.sum/b.population AS per_capita
FROM 
(SELECT county,sum(bottle_qty) as sum,avg(liter_size) as bottle_size from sales
GROUP BY county) AS a
INNER JOIN counties b
ON a.county=b.county
ORDER BY per_capita DESC
LIMIT 9

"""

pd.read_sql_query(sql, engine)

          county      sum  bottle_size  population  per_capita
0      Dickinson   371051        974.2       16667          22
1           Polk  6496762        891.9      430640          15
2     Black Hawk  2017496        861.0      131090          15
3    Cerro Gordo   623706        986.4       44151          14
4          Scott  2298322        869.9      165224          13
5        Johnson  1723308        895.2      130882          13
6           Linn  2710871        885.1      211226          12
7  Pottawattamie  1078890        890.9       93158          11
8        Kossuth   176874       1040.5       15543          11

**Prompt 9 Answer**:The nine counties in the output above have the highest liquor sold per capita. Of these nine counties, Kossuth sells the largest bottle size.

### Prompt 10 (advanced but required!)

In the `sales` table, three columns are `btl_price`, `bottle_qty`, and `total`. The `total` for a transaction _should be_ the product of `btl_price` and `bottle_qty`. How many transactions have a value of `total` that is not equal to `btl_price` time `bottle_qty`?

> There will be a type error as well! We cannot compare type `money` to type `real`. We have to convert `total` to type `money` so that we can compare the two directly. [This link](https://docs.microsoft.com/en-us/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15#syntax) may be helpful to you!

In [ ]:
# Use a SQL query to find the answer to the above prompt.

sql = """

"""

pd.read_sql_query(sql, engine)

**Prompt 10 Answer**: